In [1]:
from sqlalchemy import create_engine

In [4]:
import pandas as pd

In [2]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [3]:
engine.connect()

In [12]:
query_3 = """
SELECT COUNT(1) 
FROM green_taxi_data
WHERE DATE(lpep_pickup_datetime) = '2019-01-15' 
"""

pd.read_sql(query_3, con=engine)

   count
0  20689

In [13]:
query_4 = """
SELECT MAX(trip_distance) as max_dist, DATE(lpep_pickup_datetime) as pu_time 
FROM green_taxi_data
GROUP BY pu_time
ORDER BY max_dist DESC
LIMIT 1
"""

pd.read_sql(query_4, con=engine)

   max_dist     pu_time
0    117.99  2019-01-15

In [14]:
query_5 = """
SELECT SUM(CASE WHEN passenger_count = 2 THEN 1 ELSE 0 END) as "2", SUM(CASE WHEN passenger_count = 3 THEN 1 ELSE 0 END) as "3"
FROM green_taxi_data
WHERE DATE(lpep_pickup_datetime) = '2019-01-01'
"""

pd.read_sql(query_5, con=engine)

      2    3
0  1282  254

In [16]:
query_6 = """
SELECT "Zone" 
FROM taxi_zone as z2
JOIN 
    (SELECT MAX(tip_amount) max_tip, tr."DOLocationID" as DOLocation
    FROM green_taxi_data as tr
    JOIN taxi_zone as z
    ON tr."PULocationID" = z."LocationID"
    WHERE z."Zone" LIKE 'Astoria%%'
    GROUP BY DOLocation
    ORDER BY max_tip DESC
    LIMIT 1) as r1
ON r1.DOLocation = z2."LocationID"
"""

pd.read_sql(query_6, con=engine)

                            Zone
0  Long Island City/Queens Plaza